Ran Plan for project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/gateway-cluster-stage/gateway-stage"
        name                               = "gateway-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for gateway-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "gateway-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "gateway"
            "Service"     = "gateway"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:14" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "gateway-stage" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for gateway-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "gateway-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "gateway"
            "Service"     = "gateway"
        }
        # (12 unchanged attributes hidden)
    }

  # module.gateway_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "gateway-execution-role-stage:gateway-execution-role-stage-ssm-access"
        name        = "gateway-execution-role-stage-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/gateway/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/stage/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/88fb4996-b32a-4672-9a1c-b89758f39f30",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:11" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecs-gateway-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecs-gateway%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecs-gateway-stage
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```